# На плоскости евклидово расстояние ρ между двумя точками (x1;y1) и (x2;y2) 
# определяется так: 

# Напишите программу, определяющую евклидово расстояние между двумя точками, координаты которых заданы.
# На вход программе подаются четыре действительных числа, каждое на отдельной строке – x1,y1,x2,y2​.
# Программа должна вывести одно число – евклидово расстояние.


import math


x1 = float(input("Введите x-1 (действительное число): "))
x2 = float(input("Введите x-2 (действительное число): "))
y1 = float(input("Введите y-1 (действительное число): "))
y2 = float(input("Введите y-2 (действительное число): "))

print(math.sqrt((x1-x2)**2 + (y1-y2)**2))