# Напишите программу, вычисляющую значение тригонометрического выражения

# по заданному числу градусов x.
# На вход программе подаётся одно действительное число x, измеряемое в градусах​.
# Программа должна вывести одно число – значение тригонометрического выражения.
# Примечание 1. Тригонометрические функции принимают аргумент в радианах. Чтобы перевести градусы в радианы, воспользуйтесь формулой: 
# Примечание 2. Модуль math содержит встроенную функцию radians(), которая переводит угол из градусов в угол в радианах.

import math


x = int(input("Введите угол в градусах: "))

r = math.sin(x) + math.cos(x) + math.tan(x)**2

print(math.radians(r))
