# n школьников делят k мандаринов поровну, неделящийся остаток остается в корзине. Сколько целых мандаринов достанется каждому школьнику? Сколько целых мандаринов останется в корзине?

# На вход программе подаются два целых числа: количество школьников и количество мандаринов, каждое на отдельной строке.

# Программа должна вывести два числа: количество мандаринов, которое достанется каждому школьнику, и количество мандаринов, которое останется в корзине, каждое на отдельной строке.



n = int(input("Введите количество школьников: "))
k = int(input("Введите количество мандаринов: "))

print(f"Каждому школьнику достанится по {k//n} мандоринов")
print(f"В корзине останится {k%n} мандоринов")