# Напишите программу, которая принимает на вход действительное число x и вычисляет по нему значение: ⌊x⌋+⌈x⌉


# На вход программе подаётся одно действительное число x.
# Программа должна вывести одно число – значение указанного выражения.

# Примечание 1. 
# ⌊x⌋ – пол числа (округление x до ближайшего целого в меньшую сторону), 
# ⌈x⌉ – потолок числа (округление x до ближайшего целого в большую сторону).



import math


x = float(input("Введите действительное число: "))

print(math.ceil(x) + math.floor(x))