# В купейном вагоне имеется 9 купе с четырьмя местами для пассажиров в каждом. Напишите программу, которая определяет номер купе, в котором находится место с заданным номером (нумерация мест сквозная, начинается с 1).

# На вход программе подаётся целое число – место с заданным номером в вагоне.
# Программа должна вывести одно число – номер купе, в котором находится указанное место.

import math

while True:
    x = int(input("Какой у вас место?: "))
    if 0 < x < 37:
        print(f"Ваше место в вагоне с номеров {math.ceil(x/4)}")
        break
    else:
        print(f"Вы допустили ошибку. Вагона с таким местом нету.")
